Catalogs/Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонцаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МНПривилегированный/Ext/Module.bsl
Функция ПроверитьИУстановитьДатуЗапретаИзманных() Экспорт
	//УстановитьДатуЗапрета(,,Дата("20120202"));	
	//УстановитьДатуЗапрета(,ПолучитьОсновнуюГруппу(),Дата("20120202"));
	//ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	
	плУстанавливатьДатуЗапрета = Константы.МНУстанавливатьДатуЗапретаПоТекущемуПериоду.Получить();	
	Если НЕ плУстанавливатьДатуЗапрета Тогда
		Возврат 0;
	КонецЕсли;		
	
	пТекДата = КонецДня(ТекущаяДата());
	//пТекДата = КонецДня(Дата("20120510"));
	
	пСтрукПериод = ПолучитьПериод(пТекДата);
	Если пСтрукПериод=Неопределено Тогда
		Возврат 2;
	КонецЕсли;	
	
	пТекДатаЗапрета = НачалоДня(ПолучитьДатуЗапрета());
	
	Если пТекДата >= пСтрукПериод.КонецПериода Тогда
		Если (пТекДатаЗапрета<пСтрукПериод.КонецПериода)ИЛИ(пТекДатаЗапрета=Неопределено) Тогда
			УстановитьДатуЗапрета(,,пСтрукПериод.КонецПериода);	
			УстановитьДатуЗапрета(,ПолучитьОсновнуюГруппу(),пСтрукПериод.КонецПериода);
			ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
			
			пТекДатаЗапрета = ПолучитьДатуЗапрета();
			Сообщить("Изменена дата запрета изменения данных: "+Строка(пТекДатаЗапрета));
			Возврат 1;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат 0;
КонецФункции	

Процедура УстановитьДатуЗапрета(пОрганизация=Неопределено,Пользователь=Неопределено,пДатаЗапрета)
	Если пОрганизация=Неопределено Тогда
		пОрганизация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	
	
	НаборЗаписей=РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(пОрганизация);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Запись.Пользователь = Пользователь;
		Запись.ГраницаЗапретаИзменений = КонецДня(пДатаЗапрета);
	НаборЗаписей.Записать();
КонецПроцедуры	

Функция ПолучитьДатуЗапрета()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений КАК ДатаЗапрета,
		|	ГраницыЗапретаИзмененияДанных.Пользователь,
		|	ГраницыЗапретаИзмененияДанных.Организация
		|ИЗ
		|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	ГраницыЗапретаИзмененияДанных.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Неопределено);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаЗапрета;
	КонецЕсли;

	Возврат Неопределено
КонецФункции	

Функция ПолучитьПериод(пТекДата)
	пСтрукПериод = Новый Структура("НачалоПериода,КонецПериода",);
	
	Запрос = Новый Запрос;	
	Запрос.Текст="ВЫБРАТЬ
    	         |	Периоды.Ссылка
	             |ИЗ
	             |	Справочник.Периоды КАК Периоды
            	 |ГДЕ
        	     |	&Дата МЕЖДУ Периоды.ДатаНачалаПериода И Периоды.ДатаКонцаПериода
    	         |	И Периоды.Родитель.Ссылка <> &ПустаяСсылка";
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(пТекДата,-1));
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.Периоды.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		пМесяц = Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ГрафикЗакрытияПериода.ДатаТочкиОтсечения,
	             |	ГрафикЗакрытияПериода.ДатаЗакрытияПериода
	             |ИЗ
	             |	РегистрСведений.ГрафикЗакрытияПериода.СрезПоследних(&Дата, ) КАК ГрафикЗакрытияПериода
	             |ГДЕ
	             |	ГрафикЗакрытияПериода.Месяц = &Месяц";
	Запрос.УстановитьПараметр("Месяц", пМесяц);
	Запрос.УстановитьПараметр("Дата", пТекДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		пСтрукПериод.НачалоПериода = НачалоДня(Выборка.ДатаТочкиОтсечения);
		пСтрукПериод.КонецПериода = КонецДня(Выборка.ДатаЗакрытияПериода);
		Возврат пСтрукПериод;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	

Функция ПолучитьОсновнуюГруппу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапретаИзмененияДанных.Пользователь КАК Группа
		|ИЗ
		|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	ГраницыЗапретаИзмененияДанных.Пользователь <> &ПустойПользователь
		|	И ГраницыЗапретаИзмененияДанных.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойПользователь", Неопределено);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Группа;
	КонецЕсли;

	Возврат Справочники.ГруппыПользователей.ВсеПользователи;	
КонецФункции
